FemDesign.Results.NodalVibration
FemDesign "Nodal displacements" result

FemDesign.Results.NodalVibration.Id
Support name identifier

FemDesign.Results.NodalVibration.NodeId
Finite element node id

FemDesign.Results.NodalVibration.Ex
Displacement in global x

FemDesign.Results.NodalVibration.Ey
Displacement in global y

FemDesign.Results.NodalVibration.Ez
Displacement in global z

FemDesign.Results.NodalVibration.Fix
Rotation around global x

FemDesign.Results.NodalVibration.Fiy
Rotation around global y

FemDesign.Results.NodalVibration.Fiz
Rotation around global z

FemDesign.Results.NodalVibration.ShapeId
Load case or combination name

FemDesign.Results.NodalVibration.DeconstructNodalVibration(System.Collections.Generic.List{FemDesign.Results.NodalVibration},System.String)
The method has been created for returning the value for Grasshopper and Dynamo.
The method can still be use for C# users.